# 集合内的数据, 不能有重复, 不支持有下标, 数据没有顺序
s1 = {10, 20, 30, 40}  # 集合可变

# 2. 删除数据
# remove ( ) -- 删除指定数据, 如果数据不存在报错
# s1.remove(10)
# print(s1)  # {40, 20, 30}

# discard ( )

# pop ( )

# 1. 增加数据
# add ( ) -- 只能追加单个数据
# s1.add(100)
# print(s1)  # {100, 40, 10, 20, 30}
# s1.add([10, 20, 30])
# print(s1)  # 报错了

# update ( ) -- 只能追加数据序列
# s1.update([1, 2, 3])
# print(s1)  # {1, 2, 3, 40, 10, 20, 30}


# s1 = {10, 20, 30, 40}
# print(s1)  # {40, 10, 20, 30}

# s2 = {1, 1, 5, 2, 2, 5}
# print(s2)  # {1, 2, 5}

# 创建集合
# s3 = set()
